var myChart = echarts.init(document.getElementById('chart_3'));

var geoCoordMap = {
    '南阳/姜营机场': [112.62220444444445, 32.98697777777778],
    '厦门/高崎机场': [118.13425333333328, 24.550648888888894],
    '重庆/江北机场': [106.64577777777778, 29.720222222222223],
    '成都/双流机场': [103.9546666666667, 30.585333333333335],
    '南昌/昌北机场': [115.90226222222226, 28.869742222222214],
    '赣州/黄金机场': [114.7865866666667, 25.85542222222223],
    '武汉/天河机场': [114.21299555555557, 30.78391555555555],
    '银川/河东机场': [106.39944, 38.32644444444444],
    '庆阳/西峰机场': [107.60288444444443, 35.80049777777778],
    '西宁/曹家堡机场': [102.04889333333333, 36.534164444444464],
    '榆林/榆阳机场': [109.59830222222223, 38.36114666666667],
    '鸡西/兴凯湖机场': [131.19711111111113, 45.29844444444445],
    '西安/咸阳机场': [108.75355111111111, 34.45516444444446],
    '池州/九华山机场': [117.68999999999998, 30.744444444444444],
    '稻城/亚丁机场': [100.06644444444443, 29.316666666666666],
    '甘南/夏河机场': [102.62511111111112, 34.82066666666669],
    '毕节/飞雄机场': [105.47466666666666, 27.267111111111117],
    '沈阳/桃仙机场': [123.48353333333333, 41.64402222222222],
    '襄阳/刘集机场': [112.29562222222219, 32.152280000000005],
    '福州/长乐机场': [119.67155555555556, 25.935777777777776],
    '上海/浦东机场': [121.79791555555558, 31.150542222222217],
    '郑州/新郑机场': [113.84583111111115, 34.52096444444443],
    '深圳/宝安机场': [113.81703111111113, 22.642853333333342],
    '珠海/三灶机场': [113.38265777777778, 22.01081333333333],
    '青岛/流亭机场': [120.37920444444444, 36.27563555555556],
    '克拉玛依机场': [84.95433333333332, 45.47645777777779],
    '杭州/萧山机场': [120.43511111111113, 30.237111111111112],
    '临沧/博尚机场': [100.02911111111112, 23.742666666666665],
    '北海/福成机场': [109.30007111111108, 21.54328444444444],
    '长沙/黄花机场': [113.22162666666672, 28.19254666666666],
    '大理/荒草坝机场': [100.31977777777783, 25.65],
    '丽江/三义机场': [100.25244444444445, 26.686666666666664],
    '乌鲁木齐/地窝铺机场': [87.47866666666667, 43.91155555555556],
    '林芝/米林机场': [94.33599999999998, 29.30577777777778],
    '新源/那拉提机场': [83.38396444444449, 43.44070222222224],
    '阿里/昆莎机场': [80.05533333333332, 32.10955555555556],
    '固原/六盘山机场': [106.22622222222222, 36.08711111111111],
    '吐鲁番/交河机场': [89.10600000000001, 43.038888888888884],
    '淮安/涟水机场': [119.13, 33.79533333333335],
    '阿尔山/伊尔施机场': [119.9191111111111, 47.31688888888889],
    '博乐/阿拉山口机场': [82.30088888888889, 44.902],
    '常德/桃花源机场': [111.64348000000003, 28.92030222222222],
    '张家界/荷花机场': [110.44985333333331, 29.10467555555556],
    '桂林/两江机场': [110.04289333333332, 25.21904444444444],
    '梅县/长岗岌机场': [116.10954666666665, 24.27470666666666],
    '迪庆/香格里拉机场': [99.68444444444444, 27.793555555555557],
    '西双版纳/嘎洒机场': [100.76955555555558, 21.977777777777778],
    '大庆/萨尔图机场': [125.13955555555555, 46.75222222222223],
    '香港机场': [113.91866666666667, 22.315999999999985],
    '澳门机场': [113.59666666666666, 22.15],
    '珠海/九洲机场': [113.59436888888894, 22.25329777777778],
    '天津/滨海机场': [117.35388444444445, 39.128968888888906],
    '台湾桃园国际机场': [121.24244444444444, 25.084],
    '三亚/凤凰机场': [109.41963555555554, 18.30468],
    '宜昌/三峡机场': [111.48815111111115, 30.560364444444446],
    '南京/禄口机场': [118.86917777777774, 31.747502222222224],
    '济南/遥墙机场': [117.22558222222223, 36.861684444444435],
    '呼和浩特/白塔机场': [111.8291911111111, 40.859524444444446],
    '石家庄/正定机场': [114.70548888888891, 38.28925333333333],
    '太原/武宿机场': [112.63588, 37.75487111111109],
    '广州/白云机场': [113.31533333333333, 23.396240000000006],
    '上海/虹桥机场': [121.33809777777778, 31.206635555555554],
    '宁波/栎社机场': [121.47399555555555, 29.83007555555555],
    '南通/兴东机场': [120.98835111111113, 32.07140000000001],
    '合肥/骆岗机场': [117.30799111111111, 31.788079999999997],
    '黄山/屯溪机场': [118.25988444444445, 29.733906666666655],
    '舟山/普陀山机场': [122.3697244444445, 29.93415555555557],
    '贵阳/龙洞堡机场': [106.80133333333335, 26.54133333333333],
    '呼伦贝尔/海拉尔机场': [119.83501333333335, 49.20968444444446],
    '昆明/长水机场': [102.9488888888889, 25.106222222222218],
    '北京/首都机场': [116.60595999999997, 40.075897777777776],
    '北京西郊机场': [116.2611111111111, 39.96688888888888],
    '哈尔滨/太平机场': [126.25044444444445, 45.62733333333333],
    '临沂机场': [118.41782222222224, 35.058177777777786]
};

var BJData = [
    [{name:'北京/首都机场'}, {name:'上海/浦东机场',value:95}],
    [{name:'北京/首都机场'}, {name:'临沂机场',value:90}],
    [{name:'北京/首都机场'}, {name:'贵阳/龙洞堡机场',value:80}],
    [{name:'北京/首都机场'}, {name:'合肥/骆岗机场',value:70}],

];

var SHData = [
    [{name:'上海/浦东机场'},{name:'贵阳/龙洞堡机场',value:95}],
    [{name:'上海/浦东机场'},{name:'西宁/曹家堡机场',value:90}],
    [{name:'上海/浦东机场'},{name:'北京/首都机场',value:80}],

];

var GZData = [
    [{name:'广州/白云机场'},{name:'上海/浦东机场',value:95}],
    [{name:'广州/白云机场'},{name:'临沂机场',value:90}],
    [{name:'广州/白云机场'},{name:'贵阳/龙洞堡机场',value:80}],
    [{name:'广州/白云机场'},{name:'合肥/骆岗机场',value:70}],


];

var planePath = 'path://M1705.06,1318.313v-89.254l-319.9-221.799l0.073-208.063c0.521-84.662-26.629-121.796-63.961-121.491c-37.332-0.305-64.482,36.829-63.961,121.491l0.073,208.063l-319.9,221.799v89.254l330.343-157.288l12.238,241.308l-134.449,92.931l0.531,42.034l175.125-42.917l175.125,42.917l0.531-42.034l-134.449-92.931l12.238-241.308L1705.06,1318.313z';

var convertData = function (data) {
    console.log(data);
    var res = [];
    for (var i = 0; i < data.length; i++) {
        var dataItem = data[i];
        var fromCoord = geoCoordMap[dataItem[0].name];
        var toCoord = geoCoordMap[dataItem[1].name];
        if (fromCoord && toCoord) {
            res.push({
                fromName: dataItem[0].name,
                toName: dataItem[1].name,
                coords: [fromCoord, toCoord],
                value: dataItem[1].value
            });
        }
    }
    return res;
};

var color = ['#a6c84c', '#ffa022', '#46bee9'];
var series = [];
[['北京/首都机场', BJData], ['上海/浦东机场', SHData], ['广州/白云机场', GZData]].forEach(function (item, i) {
    //console.log(item,i);
    series.push({
        name: item[0] + ' Top10',
        type: 'lines',
        zlevel: 1,
        effect: {
            show: true,
            period: 6,
            trailLength: 0.7,
            color: '#fff',
            symbolSize: 3
        },
        lineStyle: {
            normal: {
                color: color[i],
                width: 0,
                curveness: 0.2
            }
        },
        data: convertData(item[1])
    },
    {
        name: item[0] + ' Top10',
        type: 'lines',
        zlevel: 2,
        symbol: ['none', 'arrow'],
        symbolSize: 10,
        effect: {
            show: true,
            period: 6,
            trailLength: 0,
            symbol: planePath,
            symbolSize: 15
        },
        lineStyle: {
            normal: {
                color: color[i],
                width: 1,
                opacity: 0.6,
                curveness: 0.2
            }
        },
        data: convertData(item[1])
    },
    {
        name: item[0] + ' Top10',
        type: 'effectScatter',
        coordinateSystem: 'geo',
        zlevel: 2,
        rippleEffect: {
            brushType: 'stroke'
        },
        label: {
            normal: {
                show: true,
                position: 'right',
                formatter: '{b}'
            }
        },
        symbolSize: function (val) {
            return val[2] / 8;
        },
        itemStyle: {
            normal: {
                color: color[i]
            }
        },
        data: item[1].map(function (dataItem) {
            return {
                name: dataItem[1].name,
                value: geoCoordMap[dataItem[1].name].concat([dataItem[1].value])
            };
        })
    });
});
console.log(series)

option = {
    // backgroundColor: '#404a59',
    title : {
        text: 'ATC',
        subtext: 'Influence',
        left: 'center',
        textStyle : {
            color: '#fff'
        }
    },
    tooltip : {
        trigger: 'item',
        formatter:function(params, ticket, callback){
            console.log(params);
            if(params.seriesType=="effectScatter") {
                return "线路："+params.data.name+""+params.data.value[2];
            }else if(params.seriesType=="lines"){
                return params.data.fromName+">"+params.data.toName+"<br />"+params.data.value;
            }else{
                return params.name;
            }
        }
    },
    legend: {
        orient: 'vertical',
        top: 'bottom',
        left: 'right',
        data:['北京/首都机场 Top10', '上海/浦东机场 Top10', '广州/白云机场 Top10'],
        textStyle: {
            color: '#fff'
        },
        selectedMode: 'multiple',
    },
    geo: {
        map: 'china',
        label: {
            emphasis: {
                show: true,
                color:'#fff'
            }
        },
        center: [118.114129, 32.550339],
        zoom: 1.8,
        roam: true,
        itemStyle: {
            normal: {
                areaColor: '#323c48',
                borderColor: '#404a59'
            },
            emphasis: {
                areaColor: '#2a333d'
            }
        }
    },
    series: series
};

myChart.setOption(option);